minhlg/32_ate/esp32_ft_efuse.cpp
#include "../csiclib/csicAppLib.h"
#include  <iomanip>
#include  <iostream>
#include  <fstream>
#include  <stdlib.h>

#include "math.h"
#include "stdlib.h"
#include "stdio.h"
#include "string.h"
#include "time.h"
#include <iostream>
#include <string>
#include <vector>
#include <algorithm>
#include "Tester.h"
#include "CscDmdApi.h"
#include "CErrorException.h"
#include "CscDmd.h"
#include "CSCMultiWaveApiAll.h"

#include "esp8266_ate_test_check.h"

int csicTestNo;
int DC_scan_result = 0,AC_scan_result =0;
double DVDD_testV_1[4];
double VDD_RTC_testV_1[4];
double DVDD_testV_2[4];
double VDD_RTC_testV_2[4];
double LightSleep_IDD_VBAT[4];
double LightSleep_IDD_DVDD_IO[4];
double LS_WakeUp_IDD_VBAT[4];
double LS_WakeUp_IDD_DVDD_IO[4];
double DeepSleep_IDD_VBAT[4];
double DeepSleep_IDD_DVDD_IO[4];
double DS_WakeUp_IDD_VBAT[4];
double DS_WakeUp_IDD_DVDD_IO[4];
double Chip_PD_IDD_VBAT[4];
double Chip_PD_IDD_DVDD_IO[4];
double DynamicIDD_VBAT[4];
double DynamicIDD_DVDD_IO[4];

extern int machine_site;

//=======================
//define ate efuse struct
//=======================

struct ate_efuse {

unsigned char efuse_w_disable[2]={0x10,0};
unsigned char efuse_ate_wr_disable=1;
unsigned char wifi_mac[6]={0,0,0,0,0,0};
unsigned char mac_crc=0;
unsigned char chip_verson_repeat4=0;
unsigned char chip_ver_spiconfig_reserve[3]={0,0,0};
unsigned char ck8m_freq[2]={0,0};
unsigned char sdio_ref[2]={0,0};
unsigned char spi_pad_config[5]={0,0,0,0,0};
};

struct id_file_info{

int get_site;
char filepath[64];
unsigned long long chip_id_array[10];
int id_delta;
};


void efuse_test(int reset_test_res[4],double efuse_burned[4]);

unsigned char calcrc_1byte(unsigned char abyte)
{
   unsigned char i,crc_1byte;
   crc_1byte=0;
   for(i = 0; i < 8; i++)
    {
      if(((crc_1byte^abyte)&0x01))
         {
           crc_1byte^=0x18;
           crc_1byte>>=1;
           crc_1byte|=0x80;
          }
       else
          crc_1byte>>=1;
       abyte>>=1;
     }
     return crc_1byte;
}

unsigned char calcrc_bytes(unsigned char *p,unsigned char len)
{
 unsigned char crc=0;
 while(len--)
  {
    crc=calcrc_1byte(crc^*p++);
  }
 return crc;
}

void os_test()
{

    cscExec->Test()->setCurrentName("OS_test");
// 	cscExec->Test()->setCurrentNumber(csicTestNo);
    csicDisableDpin("LNA");
    csicSetPpmuOff("LNA");
    csicDisableDpin("TOUT");
    csicSetPpmuOff("TOUT");
    csicSetDps ("DVDD_IO", 0.0, 300 MA, CONNECT);
    csicSetDps ("VBAT", 0.0, 300 MA, CONNECT);
    csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    csicFixtureRelayOn("K1");
    csicFixtureRelayOn("K2");
    cscUtil->wait(1e-3);
    csicSetDpinLevels("allpins", 0.0, 2.5, 1.2, 1.2);
	cscTester->DCLevels()->Signal("allpins")->setForceLo();
    cscUtil->wait(1e-3);

    //csicPpmuSerialFITV ("os_neg_test", "os_open_fail", "gnd_os_pins", -10 UA, -0.9, -0.2, 1 MS,PINPMU_ADC);
    OS_Test_ESP ("os_neg_test", "os_fail", "gnd_os_pins", -10 UA, -0.9, -0.2, 1 MS,PINPMU_ADC);
    //csicPpmuSerialFITV ("os_pos_test", "os_fail", "vdd_os_pins",  100 UA, 0.2,  0.9, 1 MS,PINPMU_ADC);
    cscUtil->wait(1e-3);
    csicSetDps ("alldps",0.0, 100 MA,CONNECT);
    csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
	cscTester->DCLevels()->Signal("allpins")->setForceLo();
    //csicDisableDpin("allpins");
    //csicSetPpmuOff("allpins");
    cscUtil->wait(3e-3);

    csicSetPpmuOff("VDD");
    csicDisableDpin("VDD");

	csicFixtureRelayOff("K1");
	csicFixtureRelayOff("K2");
    //csicSetDps ("alldps",0.0, 100 MA,DISCONNECT);
    csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    cscUtil->wait(1e-3);


   return;

}


void func_measure()
{
    csicSetDpinLevels("allpins", 0.0, 2.5, 1.0, 1.8);
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	//cscTester->DCLevels()->Signal("CHIP_EN")->setForceLo();
    csicSetDps ("DVDD_IO", 2.5 , 300 MA, CONNECT);
    csicSetDps ("VBAT", 2.5, 300 MA, CONNECT);
    cscUtil->wait(5e-3);
    //csicDisableDpin ("allpins");
    csicSetDpinLevels("func_measure_allpins",0, 2.5, 1, 1.8);
    csicEnableDpin("func_measure_allpins");
    csicSetDpinLevels("XTAL_P",0, 2.5, 1, 1.8);
    csicEnableDpin("XTAL_P");
    cscUtil->wait(1e-3);
    int pause_time =0;
//	csicFuncTest("digital measure","func_dig_fail","func_measure");



    cscTester->Seq()->start("func_measure");
    while (cscTester->Seq()->getRunStatus() == BUSY) {
      if (cscTester->Seq()->isPaused()) {
         if (pause_time == 0) {
             csicDpsMeasI ("VBAT", 1 mA, Chip_PD_IDD_VBAT, 0.1 MS, 20);
             csicDpsMeasI ("DVDD_IO", 1 mA, Chip_PD_IDD_DVDD_IO, 0.1 MS, 20);

         } else if (pause_time ==1) {
             csicDpsMeasI ("VBAT", 10 mA, LightSleep_IDD_VBAT, 0.1 MS, 20);
             csicDpsMeasI ("DVDD_IO", 10 mA, LightSleep_IDD_DVDD_IO, 0.1 MS, 20);

         } else if (pause_time ==2) {
             csicDpsMeasI ("VBAT", 50 mA, LS_WakeUp_IDD_VBAT, 0.1 MS, 20);
             csicDpsMeasI ("DVDD_IO", 50 mA, LS_WakeUp_IDD_DVDD_IO, 0.1 MS, 20);

         } else if (pause_time == 3) {
             //csicPpmuFIMV ("DVDD", 0 MA,DPIN96_VRANGE_8V, DVDD_testV_1, 0.1 mS,0.1 V,1.6 V);
             //csicPpmuFIMV ("VDD_RTC", 0 MA,DPIN96_VRANGE_8V, VDD_RTC_testV_1, 0.1 mS,0.1 V,1.6 V );


             csicDpsMeasI ("VBAT", 150 mA, DynamicIDD_VBAT, 0.1 MS, 20);
             csicDpsMeasI ("DVDD_IO", 50 mA, DynamicIDD_DVDD_IO, 0.1 MS, 20);


         } else if (pause_time == 4) {
             csicDpsMeasI ("VBAT", 1 mA, DeepSleep_IDD_VBAT, 0.1 MS, 20);
             csicDpsMeasI ("DVDD_IO", 1 mA, DeepSleep_IDD_DVDD_IO, 0.1 MS, 20);


             cscUtil->wait(10e-3);

         } else if (pause_time ==5) {
             csicDpsMeasI ("VBAT", 50 mA, DS_WakeUp_IDD_VBAT, 0.1 MS, 20);
             csicDpsMeasI ("DVDD_IO", 50 mA, DS_WakeUp_IDD_DVDD_IO, 0.1 MS, 20);

         }
         pause_time++;
         cscTester->Seq()->resume();
      }
    }

             csicVariableTest("Chip_PD_IDD_VBAT","func_idd_fail",Chip_PD_IDD_VBAT,-0.5 mA,0.5 mA,"A");
             csicVariableTest("Chip_PD_IDD_DVDD_IO","func_idd_fail",Chip_PD_IDD_DVDD_IO,-0.5 mA,0.5 mA,"A");
             csicVariableTest("LightSleep_IDD_VBAT","func_idd_fail",LightSleep_IDD_VBAT,0 mA,0.5 mA,"A");
             csicVariableTest("LightSleep_IDD_DVDD_IO","func_idd_fail",LightSleep_IDD_DVDD_IO,0 mA,1 mA ,"A");
             csicVariableTest("LS_WakeUp_IDD_VBAT","func_idd_fail",LS_WakeUp_IDD_VBAT,16 mA,27 mA,"A");
             csicVariableTest("LS_WakeUp_IDD_DVDD_IO","func_idd_fail",LS_WakeUp_IDD_DVDD_IO,10 mA,18 mA,"A");
             //csicVariableTest("DVDD_V_Test","func_idd_fail",DVDD_testV_1,1.05 ,1.2 ,"V");
             //csicVariableTest("VDD_RTC_V_Test","func_idd_fail",VDD_RTC_testV_1,1.05 ,1.2 ,"V");
             csicVariableTest("DynamicIDD_VBAT","func_idd_fail",DynamicIDD_VBAT,75 mA,105 mA,"A");
             csicVariableTest("DynamicIDD_DVDD_IO","func_idd_fail",DynamicIDD_DVDD_IO,9 mA,20 mA,"A");
             csicVariableTest("DeepSleep_IDD_VBAT","func_idd_fail",DeepSleep_IDD_VBAT,-0.5 mA,0.5 mA,"A");
             csicVariableTest("DeepSleep_IDD_DVDD_IO","func_idd_fail",DeepSleep_IDD_DVDD_IO,-0.5 mA,0.5 mA,"A");
             csicVariableTest("DS_WakeUp_IDD_VBAT","func_idd_fail",DS_WakeUp_IDD_VBAT,18 mA,25 mA,"A");
             csicVariableTest("DS_WakeUp_IDD_DVDD_IO","func_idd_fail",DS_WakeUp_IDD_DVDD_IO,9 mA,16 mA,"A");

