minhlg/32_ate/esp32_ft_efuse.cpp
    while(cscTester->Seq()->getRunStatus() == BUSY);
    int mbist_part1_capture_count = cscTester->DCM()->getCapturedCycleCount();
    if (mbist_part1_capture_count != 1) {
         cscExec->Datalog()->printf("mbist part1 capture cycle fail\ncycle is %d\n",mbist_part1_capture_count);
    }
CSC_SERIAL_BLOCK_BEGIN
    unsigned long* mbist_part1_capture_data = new unsigned long[mbist_part1_capture_count];
    memset(mbist_part1_capture_data, 0, sizeof(mbist_part1_capture_data));
    cscTester->DCM()->getCapturedDataBySite(*cscIter,"MBIST_OUT",0, mbist_part1_capture_count,mbist_part1_capture_data, DCM_HW);
    mbist_res1[*cscIter] = mbist_part1_capture_data[0];
    /*
    if ((mbist_res1&0x2) == 0) {
       int reset_res = 1;
       csicVariableTest("reset_clk_test_part1","reset_clk_fail",reset_res,0,0,"");
    } else if (mbist_res1 == 0x2) {
       int mbist_res = 0;
       csicVariableTest("mbist_test_part1","mbist_fail",mbist_res,-1,1,"");
    } else {
       int mbist_res = 2;
       csicVariableTest("mbist_test_part1","mbist_fail",mbist_res,-1,1,"");
    }
    */
CSC_SERIAL_BLOCK_END

    vector<string> lablist2_mbist;
    lablist2_mbist.clear();
    lablist2_mbist.push_back("mbist_part2_cap.Capdata2_mbist");
    cscTester->DCM()->add("ADC_dcm_mbist_part2",lablist2_mbist,lablist2_mbist,"MBIST_OUT");
    cscTester->DCM()->enable("ADC_dcm_mbist_part2");
    cscUtil->wait(0.001);
    cscExec->Test()->resetCumulativeResult();
    csicFuncSeq("mbist_part2_cap");

    while(cscTester->Seq()->getRunStatus() == BUSY);
    int mbist_part2_capture_count = cscTester->DCM()->getCapturedCycleCount();
    if (mbist_part2_capture_count != 1) {
         cscExec->Datalog()->printf("mbist part2 capture cycle fail\ncycle is %d\n",mbist_part2_capture_count);
    }
CSC_SERIAL_BLOCK_BEGIN
    unsigned long* mbist_part2_capture_data = new unsigned long[mbist_part2_capture_count];
    memset(mbist_part2_capture_data, 0, sizeof(mbist_part2_capture_data));
    cscTester->DCM()->getCapturedDataBySite(*cscIter,"MBIST_OUT",0, mbist_part2_capture_count,mbist_part2_capture_data, DCM_HW);

    mbist_res2[*cscIter] = mbist_part2_capture_data[0];

    //cscExec->Datalog()->printf("part2 value %d \n",mbist_part2_capture_data[0]);

    unsigned long mbist_cap0 = mbist_res0[*cscIter];
    unsigned long mbist_cap1 = mbist_res1[*cscIter];
    unsigned long mbist_cap2 = mbist_res2[*cscIter];

    //0: clk fail
    //1: mbist fail
    //2: reset fail
    //3: mbist pass

    if (((mbist_cap0&0x2) == 0) && ((mbist_cap1&0x2) == 0)) {
       mbist_res[*cscIter] = 0;
       mbist_pass[*cscIter] = 0;
    } else if (((mbist_cap0&0x2) == 2) && ((mbist_cap1&0x2) == 2) && ((mbist_cap2&0x2) == 0)) {
       mbist_res[*cscIter] = 2;
       mbist_pass[*cscIter] = 0;
    } else if((mbist_cap0 == 2) && (mbist_cap1 == 2)) {
       mbist_res[*cscIter] = 3;
       mbist_pass[*cscIter] = 1;
    } else {
       mbist_res[*cscIter] = 1;
       mbist_pass[*cscIter] = 0;
    }

CSC_SERIAL_BLOCK_END


    //csicDisableDpin("mbist_test_allpins");
    csicDisableDpin("XTAL_P");
/*
CSC_SERIAL_BLOCK_BEGIN
    unsigned long* mbist_capture_data = new unsigned long[mbist_capture_count];
    memset(mbist_capture_data, 0, sizeof(mbist_capture_data));
    cscTester->DCM()->getCapturedDataBySite(*cscIter,"MBIST_OUT",0, mbist_capture_count,mbist_capture_data, DCM_HW);
    unsigned long mbist_res0 = mbist_capture_data[0];
    unsigned long mbist_res1 = mbist_capture_data[28868];
//    cscExec->Datalog()->printf("mbist_res0 : %d,mbist_res1 : %d\n",mbist_res0,mbist_res1);
    if (((mbist_res0&0x2) == 0) & ((mbist_res1&0x2) == 0)) {
       int reset_res = 1;
       csicVariableTest("reset_clk_test","reset_clk_fail",reset_res,0,0,"");
    } else if ((mbist_res0 == 0x2) & (mbist_res1 == 0x2)) {
       int mbist_res = 0;
       csicVariableTest("mbist_test","mbist_fail",mbist_res,-1,1,"");
    } else {
       int mbist_res = 2;
       csicVariableTest("mbist_test","mbist_fail",mbist_res,-1,1,"");
    }
CSC_SERIAL_BLOCK_END
*/
    //csicDisableDpin("mbist_test_allpins");
	cscUtil->wait(0.001);

	//csicSetDps ("alldps", 0, 100 MA, CONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    //cscUtil->wait(5e-3);
    //csicSetDps ("alldps", 0, 100 MA, DISCONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    //cscUtil->wait(1e-3);

    efuse_test(mbist_pass,efuse_burned);
    csicVariableTest("clk_test","clk_fail",mbist_res,1,3,"");
    csicVariableTest("mbist_test","mbist_fail",mbist_res,2,3,"");

    //5:reset_fir_fail
    //4:reset_sec_fail
CSC_SERIAL_BLOCK_BEGIN
    if ((mbist_res[*cscIter] == 2) && (efuse_burned[*cscIter] == 1)) {
       mbist_res[*cscIter] = 4;
    } else if ((mbist_res[*cscIter] == 2) && (efuse_burned[*cscIter] == 0)) {
       mbist_res[*cscIter] = 5;
    }
CSC_SERIAL_BLOCK_END
    csicVariableTest("reset_test","reset_fir_fail",mbist_res,3,4,"");
    csicVariableTest("reset_test","reset_sec_fail",mbist_res,3,3,"");

    return;
}

void scan_test()
{
    csicSetDpinLevels("allpins", 0, 2.5, 1.0, 1.8);
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	//cscTester->DCLevels()->Signal("CHIP_EN")->setForceLo();
    csicSetDps ("DVDD_IO", 2.5 , 300 MA, CONNECT);
    csicSetDps ("VBAT",    2.5,  300 MA, CONNECT);
//    csicSetDps ("VDD11",   1.15, 300 MA, CONNECT);
    cscUtil->wait(5e-3);
    //csicDisableDpin("allpins");
    csicSetDpinLevels("dc_scan_allpins", 0, 2.5, 1.0, 1.8);
    csicSetDpinLevels("XTAL_P",0, 2.5, 1.0, 1.8);
    csicEnableDpin("dc_scan_allpins");
    //csicEnableDpin("XTAL_P");
    cscUtil->wait(1e-3);
    csicFuncSeq("wait_reset");
    csicSetDps ("DVDD11",  1.15, 100 MA, CONNECT);    //DVDD_1.1V
    csicSetDps ("VDD11",   1.15, 100 MA, CONNECT); //VDD_RTC
    cscUtil->wait(3e-3);
    csicFuncTest("Dc_Scan_test","dc_scan_fail","dc_scan");
    csicFuncTest("Ac_Scan_test","ac_scan_fail","ac_scan");
    cscTester->DPS()->Signal("DVDD11")->disconnect();
    cscTester->DPS()->Signal("VDD11")->disconnect();
    cscUtil->wait(10e-3);
    //csicFuncSeq("chip_pd");

//	csicFuncTest("Io_Bist_test","io_bist_fail","io_mbist");//just for debug

