minhlg/32_ate/esp32_ft_efuse.cpp
/*
    cscExec->Test()->setCurrentName("Dc_Scan_test");
    cscTester->Seq()->setStartAddress("dc_scan");
    cscUtil->wait(0.1e-3);
    cscExec->Test()->func();
    if(cscExec->Test()->getCumulativeResult() == FAIL)
       { DC_scan_result = 1;
       }
    cscExec->Test()->resetCumulativeResult();


    cscExec->Test()->setCurrentName("Ac_Scan_test");
    cscTester->Seq()->setStartAddress("ac_scan");
    cscUtil->wait(0.1e-3);
    cscExec->Test()->func();
    if(cscExec->Test()->getCumulativeResult() == FAIL)
       { AC_scan_result = 1;
       }
    cscExec->Test()->resetCumulativeResult();


*/
    //csicDisableDpin("dc_scan_allpins");
	//cscUtil->wait(0.005);

	//csicSetDps ("alldps", 0, 100 MA, CONNECT);
    //cscUtil->wait(5e-3);
    //csicSetDps ("alldps", 0, 100 MA, DISCONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    //cscUtil->wait(1e-3);
    return;

}



struct id_file_info read_chip_id(int machine_site){

struct id_file_info id_file_read;

id_file_read.get_site=machine_site;
sprintf(id_file_read.filepath,"/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP32_%d.txt",id_file_read.get_site);


if(access(id_file_read.filepath, W_OK) != 0) {
    cerr<<"Chip_ID file can not be writen! please reset as writable!\n";
    exit(1);
}

ifstream inIDFile;

inIDFile.open(id_file_read.filepath,ios::in);

if(!inIDFile){

  cerr<<"Chip id file can't be opened!0\n";
  exit(1);
}

    int inID_num = 0;

    while (inIDFile>>hex>>id_file_read.chip_id_array[inID_num]) {
    	inID_num = inID_num + 1;
      if (inID_num > 9) {
        cerr<<"Chip_ID file abnormal!1\n";
        exit(1);
      }
    }

    if (inID_num != 9) {
        cerr<<"Chip_ID file abnormal!2\n";
        exit(1);
    }
    //if ((machine_site>3) | (machine_site<1)) {
    //	printf("Please make sure you are in the engineer mode!\n\r ");
    //}
    if (id_file_read.chip_id_array[0] != machine_site) {
        cerr<<"Chip_ID file is not match with this D10!\n";
        exit(1);
    }

	if ((id_file_read.chip_id_array[8] <= id_file_read.chip_id_array[2]) | (id_file_read.chip_id_array[8] >= id_file_read.chip_id_array[3])) {
	   cerr<<"All Chip_ID has been used!\n";
       exit(1);
	}

	id_file_read.id_delta = id_file_read.chip_id_array[5] - id_file_read.chip_id_array[4];
	//printf("delta value: %d \n",delta);

	if (id_file_read.id_delta != 2) {
	   cerr<<"Chip_ID file abnormal!3\n";
       exit(1);
	}

    for (inID_num=4;inID_num<8;inID_num++) {
      if ((id_file_read.chip_id_array[inID_num+1] - id_file_read.chip_id_array[inID_num]) != id_file_read.id_delta) {
        cerr<<"Chip_ID file abnormal!4\n";
        exit(1);
      }
    }
    inIDFile.close();


    return id_file_read;

}

void update_chip_id(struct id_file_info id_file_read,unsigned long long last_id_burned){


ofstream outIDFile;
outIDFile.open(id_file_read.filepath,ios::out);

if(!outIDFile) {
        cerr<<"Chip ID file can't be opened\n";
        exit(1);
    }

int i;
for(i=4;i<9;i++){
    id_file_read.chip_id_array[i]=id_file_read.chip_id_array[i]+id_file_read.id_delta;
}

if(id_file_read.chip_id_array[8]!=last_id_burned){

        cerr<<"Chip ID can't match record!\n";
        exit(1);

}

for(i=0;i<10;i++){
    outIDFile<<hex<<id_file_read.chip_id_array[i]<<endl;
}
outIDFile.close();

}


void efuse_test_32(){

// for stdf record chip_id_value
    unsigned long long chip_id_value[4] = {0,0,0,0};
    double chip_id_value0[4] = {0,0,0,0};
    double chip_id_value1[4] = {0,0,0,0};
    double efuse_bad[4] = {0,0,0,0};

    struct ate_efuse efuse_read;
    struct ate_efuse efuse_to_burn;
    struct id_file_info id_file_read;

    unsigned long long to_burn_id_l;
    unsigned long long to_burn_id_h;




//initial chip
// read chip efuse,compare(get efuse_read)
// if not burned, burn efuse

CSC_SERIAL_BLOCK_BEGIN
   // 1,read id file,get chip id info
   // 2,make efuse_to_burn
   // 3,burn efuse
   // 4,update id file


// 1,read id file,get chip id info
id_file_read=read_chip_id(machine_site);



// 2,make efuse_to_burn
to_burn_id_l=id_file_read.chip_id_array[8]+id_file_read.id_delta;
to_burn_id_h=id_file_read.chip_id_array[1];

efuse_to_burn.wifi_mac_l[0]=to_burn_id_l%256;
efuse_to_burn.wifi_mac_l[1]=(to_burn_id_l>>8£©%256;
efuse_to_burn.wifi_mac_l[2]=(to_burn_id_l>>16£©%256;

efuse_to_burn.wifi_mac_h[0]=to_burn_id_h%256;
efuse_to_burn.wifi_mac_h[1]=(to_burn_id_h>>8£©%256;
efuse_to_burn.wifi_mac_h[2]=(to_burn_id_h>>16£©%256;

efuse_to_burn.mac_crc=calcrc_bytes(efuse_to_burn.wifi_mac,6);


// 3,burn efuse



// 4,update id file

update_chip_id(id_file_read,to_burn_id_l);

}


void efuse_test(int reset_test_res[4],double efuse_burned[4])
{
    unsigned long long chip_id_value[4] = {0,0,0,0};
    double chip_id_value0[4] = {0,0,0,0};
    double chip_id_value1[4] = {0,0,0,0};
    double efuse_bad[4] = {0,0,0,0};


    csicSetDpinLevels("allpins",0.0, 2.5, 1.0, 1.8);
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	//cscTester->DCLevels()->Signal("CHIP_EN")->setForceLo();
    csicSetDps ("DVDD_IO", 2.6 , 300 MA, CONNECT);
    csicSetDps ("VBAT",    2.6, 300 MA, CONNECT);
    cscUtil->wait(5e-3);

    //csicDisableDpin ("allpins");
//    csicSetPpmuFV("CHIP_EN",0,20 MA);
//	csicSetPpmuFV("RSTB",2.5 ,20 MA);
//	cscUtil->wait(.005);
    csicSetDpinLevels("efuse_allpins",0.0, 2.5, 1.0, 1.8);
    csicSetDpinLevels("XTAL_P",0.0, 2.5, 1.0, 1.8);
    csicEnableDpin("efuse_allpins");
    csicEnableDpin("XTAL_P");
    cscUtil->wait(1e-3);

    vector<string> lablist0;
    lablist0.clear();
    lablist0.push_back("efuse_read.Capdata0");
    vector<string> lablist1;
    lablist1.clear();
    lablist1.push_back("efuse_read.Capdata1");
    cscTester->DCM()->add("ADC_dcm_efuse",lablist0,lablist1,"EFUSE_OUT");
    cscTester->DCM()->enable("ADC_dcm_efuse");
    csicEnableDpin("efuse_allpins");
    cscUtil->wait(0.001);
    cscExec->Test()->resetCumulativeResult();

    csicFuncSeq("efuse_read");

    while(cscTester->Seq()->getRunStatus() == BUSY);
    int efuse_capture_count = cscTester->DCM()->getCapturedCycleCount();
    if (efuse_capture_count != 257) {
         cscExec->Datalog()->printf("efuse capture cycle fail\ncycle is %d\n",efuse_capture_count);
     }
    csicDisableDpin("efuse_allpins");
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	cscTester->DCLevels()->Signal("CHIP_EN")->setForceHi();
    csicDisableDpin("XTAL_P");
	cscUtil->wait(0.001);

	//csicSetDps ("alldps", 0, 100 MA, CONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    //cscUtil->wait(5e-3);
    //csicSetDps ("alldps", 0, 100 MA, DISCONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    //cscUtil->wait(1e-3);

CSC_SERIAL_BLOCK_BEGIN
    ifstream inIDFile;
    if (machine_site ==1) {
      inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_1.txt",ios::in);
    } else if (machine_site == 2) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_2.txt",ios::in);
	} else if (machine_site == 3) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_3.txt",ios::in);
	} else if (machine_site == 4) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_4.txt",ios::in);
	} else if (machine_site == 5) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_5.txt",ios::in);
	} else if (machine_site == 6) {
    	inIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_6.txt",ios::in);
	}


    if(!inIDFile) {
        cerr<<"Chip ID file can't be opened\n";
        exit(1);
    }
    int inID_num = 0;
    unsigned long long chip_id_array[10] = {0,0,0,0,0,0,0,0,0};

