minhlg/32_ate/esp32_ft_efuse.cpp
    while (inIDFile>>hex>>chip_id_array[inID_num]) {
    	inID_num = inID_num + 1;
  if (inID_num > 9) {
        cerr<<"Chip_ID file abnormal!1\n";
        exit(1);
      }
    }
    if (inID_num != 9) {
        cerr<<"Chip_ID file abnormal!2\n";
        exit(1);
    }
    if ((machine_site>6) | (machine_site<1)) {
    	printf("Please make sure you are in the engineer mode!\n\r ");
    }
    else if (chip_id_array[0] != machine_site) {
        cerr<<"Chip_ID file is not match with this D10!\n";
        exit(1);
    }

	if ((chip_id_array[8] <= chip_id_array[2]) | (chip_id_array[8] >= chip_id_array[3])) {
	   cerr<<"All Chip_ID has been used!\n";
       exit(1);
	}

	int delta = chip_id_array[5] - chip_id_array[4];
	//printf("delta value: %d \n",delta);

	if ((delta != 1) & (delta != -1)) {
	   cerr<<"Chip_ID file abnormal!3\n";
       exit(1);
	}

    for (inID_num=4;inID_num<8;inID_num++) {
      if ((chip_id_array[inID_num+1] - chip_id_array[inID_num]) != delta) {
        cerr<<"Chip_ID file abnormal!4\n";
        exit(1);
      }
    }
    inIDFile.close();


    unsigned long* efuse_data_opp = new unsigned long[257];
    unsigned long* efuse_data     = new unsigned long[128];
    memset(efuse_data_opp, 1, sizeof(efuse_data_opp));
    memset(efuse_data,     1, sizeof(efuse_data));
    cscTester->DCM()->getCapturedDataBySite(*cscIter,"EFUSE_OUT",0, efuse_capture_count,efuse_data_opp, DCM_HW);
    int i =0;
    for (i=0;i<256;i++) {
      if ((i%2) == 0) {
        efuse_data[127-i/2] = efuse_data_opp[i];
//        cscExec->Datalog()->printf("num %d:%x\n",127-i/2,efuse_data[127-i/2]);
      }
    }

    unsigned long long mac_addr_read=0;
    unsigned char mac_addr_read_byte_l[4] = {0,0,0,0};
    unsigned char mac_addr_read_byte_h[3] = {0,0,0};
    unsigned char mac_crc_read_l =0;
    unsigned char mac_crc_read_h =0;
    unsigned char mac_crc_exp_l =0;
    unsigned char mac_crc_exp_h =0;

    unsigned long efuse_version_read = (efuse_data[59] <<3) + (efuse_data[58] <<2) + (efuse_data[57] <<1) + (efuse_data[56] <<0);
//    cscExec->Datalog()->printf("efuse version %d\n",efuse_version_read);
    if (efuse_version_read == 0) {
    	for (i=0;i<128;i++) {
    	  if (efuse_data[i]!=0) {
    	    efuse_bad[*cscIter] = 12;
    	  }
    	}
//        cscExec->Datalog()->printf("In case 1\n");

    } else if (efuse_version_read != 2) {
    	efuse_bad[*cscIter] = 3;
//        cscExec->Datalog()->printf("In case 1\n");
    } else {
//      cscExec->Datalog()->printf("In case 2\n");
      for (i=124;i<128;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 4;
        }
      }
      for (i=120;i<124;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 3;
        }
      }
      for (i=80;i<88;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 9;
        }
      }

      if (efuse_data[79] != 1) {
        efuse_bad[*cscIter] = 5;
      }
      if (efuse_data[78] != 0) {
        efuse_bad[*cscIter] = 6;
      }
      if (efuse_data[77] != 1) {
        efuse_bad[*cscIter] = 7;
      }
      for (i=60;i<76;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 8;
        }
      }
      for (i=0;i<16;i++) {
        if (efuse_data[i] != 0) {
          efuse_bad[*cscIter] = 2;
        }
      }
      for (i=24;i<56;i++) {
      	mac_addr_read = mac_addr_read + (efuse_data[i] << (i-24));
        mac_addr_read_byte_l[(i-24)/8] = mac_addr_read_byte_l[(i-24)/8] + (efuse_data[i] << ((i-24)%8));
      }
      for (i=16;i<24;i++) {
        mac_crc_read_l = mac_crc_read_l + (efuse_data[i] << (i-16));
      }
      mac_crc_exp_l = calcrc_bytes(mac_addr_read_byte_l,4);
//      cscExec->Datalog()->printf("efuse crc read : 0x%x,crc exp 0x%x\n",mac_crc_read,mac_crc_exp);
      if (mac_crc_exp_l != mac_crc_read_l) {
        efuse_bad[*cscIter] = 1;
      } else {
        efuse_burned[*cscIter] = 1;
      }

      if (efuse_data[76] == 1) {
        for (i=96;i<120;i++) {
          mac_addr_read_byte_h[(i-96)/8] = mac_addr_read_byte_h[(i-96)/8] + (efuse_data[i] << ((i-96)%8));
        }
        for (i=88;i<96;i++) {
          mac_crc_read_h = mac_crc_read_h + (efuse_data[i] << (i-88));
        }
        mac_crc_exp_h = calcrc_bytes(mac_addr_read_byte_h,3);
//          cscExec->Datalog()->printf("efuse crc read : 0x%x,crc exp 0x%x\n",mac_crc_read,mac_crc_exp);
        if (mac_crc_exp_h != mac_crc_read_h) {
          efuse_bad[*cscIter] = 11;
        } else {
          efuse_burned[*cscIter] = 1;
        }
      } else {
      	for (i=88;i<120;i++) {
          if (efuse_data[i] != 0) {
            efuse_bad[*cscIter] = 10;
          }
        }
      }
    }

    if (efuse_bad[*cscIter]) {
       //csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
       //csicVariableTest("chip_id","efuse_fail",mac_addr_read,0,0x100000000,"");
       //csicVariableTest("efuse_burned","efuse_fail",efuse_burned,1,1,"");
       chip_id_value[*cscIter] =0;
       for (i=16;i<56;i++) {
         chip_id_value[*cscIter] = chip_id_value[*cscIter] + (efuse_data[i] << (i-16));
       }
    } else if (efuse_burned[*cscIter]) {
       //csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
       //csicVariableTest("chip_id","efuse_fail",mac_addr_read,0,0x100000000,"");
       //csicVariableTest("efuse_burned","efuse_fail",efuse_burned,1,1,"");
       chip_id_value[*cscIter] = mac_addr_read;
       if ((chip_id_value[*cscIter] >= chip_id_array[3]) | (chip_id_value[*cscIter]<= chip_id_array[2])) {
         efuse_bad[*cscIter] = 12;
       }
    } else if (reset_test_res[*cscIter] == 0) {//0:mbist not pass
       chip_id_value[*cscIter] = mac_addr_read;
    } else {
    unsigned long long chip_id = 0,bit_id = 0,bit_addr_in = 0,bit_addr_out = 0;
    chip_id = chip_id_array[8];
//    cout<<"CHIP_ID is "<<chip_id+1<<endl;

    std::vector<std::string> sigGroupNames;
    std::vector<char> vec;

    int singbit = 0;
    bit_addr_in = cscTester->PatternMemory()->getLabelAddress("efuse.in_bit0");
    bit_addr_out = cscTester->PatternMemory()->getLabelAddress("efuse.out_bit80");



    chip_id = chip_id + delta;

    //printf("chip_id: %x \n",chip_id);

    chip_id_value[*cscIter]  = chip_id;
    unsigned char mac_addr_l[4];
    unsigned char mac_addr_h[3];
    unsigned char mac_addr_crc_h;
    unsigned char mac_addr_crc_l;

