minhlg/32_ate/esp32_ft_efuse.cpp
    mac_addr_l[0] = chip_id%256;
    mac_addr_l[1] = (chip_id>>8)%256;
    mac_addr_l[2] = (chip_id>>16)%256;
    mac_addr_l[3] = 0;
    mac_addr_h[0] = chip_id_array[1]%256;
    mac_addr_h[1] = (chip_id_array[1]>>8)%256;
    mac_addr_h[2] = (chip_id_array[1]>>16)%256;
    mac_addr_crc_l = calcrc_bytes(mac_addr_l,4);
    mac_addr_crc_h = calcrc_bytes(mac_addr_h,3);
    unsigned char efuse_version = 2;
    unsigned char efuse_data[6];
    //mac_addr_crc = 0x1;

    unsigned long* efuse_to_burn_data = new unsigned long[16];

    efuse_to_burn_data[0] = 0;
    efuse_to_burn_data[1] = 0;
    efuse_to_burn_data[2] = mac_addr_crc_l;
    efuse_to_burn_data[3] = mac_addr_l[0];
    efuse_to_burn_data[4] = mac_addr_l[1];
    efuse_to_burn_data[5] = mac_addr_l[2];
    efuse_to_burn_data[6] = mac_addr_l[3];
    efuse_to_burn_data[7] = efuse_version;
    efuse_to_burn_data[8] = 0;
    efuse_to_burn_data[9] = 0xb0;
    efuse_to_burn_data[10] = 0;
    efuse_to_burn_data[11] = mac_addr_crc_h;
    efuse_to_burn_data[12] = mac_addr_h[0];
    efuse_to_burn_data[13] = mac_addr_h[1];
    efuse_to_burn_data[14] = mac_addr_h[2];
    efuse_to_burn_data[15] = 0;


//cscExec->Datalog()->printf("\nBit num is:\n");
    for(int i=0;i<128;i++) {
        if (i%8 ==0) {
          bit_id = efuse_to_burn_data[i/8];
        }
        singbit = bit_id%2;
        bit_id = bit_id/2;
//        cscExec->Datalog()->printf("num %d:%x\n",i,singbit);
//        cout<<singbit<<endl;

        if(singbit == 1) {
            sigGroupNames.clear();sigGroupNames.push_back("SD_D1");
            vec.clear();vec.push_back('1');
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_in,sigGroupNames,vec);
            bit_addr_in++;
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_in,sigGroupNames,vec);
            bit_addr_in++;

            /*
            sigGroupNames.clear();sigGroupNames.push_back("MTDO");
            vec.clear();vec.push_back('H');
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_out,sigGroupNames,vec);
            bit_addr_out = bit_addr_out -2;
            */
//  cscExec->Datalog()->printf("%d ",singbit);

        }
        else
        {
            sigGroupNames.clear();sigGroupNames.push_back("SD_D1");
            vec.clear();vec.push_back('0');
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_in,sigGroupNames,vec);
            bit_addr_in++;
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_in,sigGroupNames,vec);
            bit_addr_in++;

            /*
            sigGroupNames.clear();sigGroupNames.push_back("MTDO");
            vec.clear();vec.push_back('L');
            cscTester->PatternMemory()->setVectorDataAtAddress(bit_addr_out,sigGroupNames,vec);
            bit_addr_out = bit_addr_out -2;
            */
//  cscExec->Datalog()->printf("%d ",singbit);
        }

    }
    ofstream outIDFile;
    if (machine_site == 1) {
      outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_1.txt",ios::out);
    }	else if (machine_site == 2) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_2.txt",ios::out);
    }   else if (machine_site == 3) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_3.txt",ios::out);
    } else if (machine_site == 4) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_4.txt",ios::out);
    } else if (machine_site == 5) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_5.txt",ios::out);
    } else if (machine_site == 6) {
    	outIDFile.open("/usr/local/home/prod/DATA_LOCAL/ESP_ID_file/Chip_ID_ESP8266_6.txt",ios::out);
    }

    if(!outIDFile) {
        cerr<<"Chip ID file can't be opened\n";
        exit(1);
    }
    outIDFile<<hex<<chip_id_array[0]<<endl;
    outIDFile<<hex<<chip_id_array[1]<<endl;
    outIDFile<<hex<<chip_id_array[2]<<endl;
    outIDFile<<hex<<chip_id_array[3]<<endl;
    outIDFile<<hex<<chip_id_array[5]<<endl;
    outIDFile<<hex<<chip_id_array[6]<<endl;
    outIDFile<<hex<<chip_id_array[7]<<endl;
    outIDFile<<hex<<chip_id_array[8]<<endl;
    outIDFile<<hex<<chip_id<<endl;
    outIDFile.close();

    csicSetDpinLevels("allpins",0.0, 2.5, 1.0, 1.8);
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	//cscTester->DCLevels()->Signal("CHIP_EN")->setForceLo();
    csicSetDps ("DVDD_IO", 2.6 , 300 MA, CONNECT);
    csicSetDps ("VBAT",    2.6, 300 MA, CONNECT);
    cscUtil->wait(5e-3);

    //csicDisableDpin ("allpins");
//    csicSetPpmuFV("CHIP_EN",0,20 MA);
//	csicSetPpmuFV("RSTB",2.5 ,20 MA);
//	cscUtil->wait(.005);
    csicSetDpinLevels("efuse_allpins",0.0, 2.5, 1.0, 1.8);
    csicSetDpinLevels("XTAL_P",0.0, 2.5, 1.0, 1.8);
    csicEnableDpin("efuse_allpins");
    csicEnableDpin("XTAL_P");
    cscUtil->wait(1e-3);
    //csicFuncTest("Efuse_test","efuse_fail","efuse");
    csicFuncSeq("efuse");
//    csicVariableTest("Pause","func_idd_fail",1 ,1 ,1 ,"V");

    //csicVariableTest("chip_id","efuse_fail",chip_id,0,0x100000000,"");
    //csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
    //csicVariableTest("chip_id","efuse_fail",chip_id,0,0x100000000,"");
    //csicVariableTest("efuse_burned","efuse_fail",efuse_burned,1,1,"");

    cscUtil->wait(0.001);
  }

    //csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
    //csicVariableTest("chip_id","efuse_fail",chip_id,0,0x100000000,"");


    csicDisableDpin("efuse_allpins");
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	cscTester->DCLevels()->Signal("CHIP_EN")->setForceHi();
    csicDisableDpin("XTAL_P");

  chip_id_value1[*cscIter] = ((chip_id_value[*cscIter]%0x1000000)/10000000);
  chip_id_value0[*cscIter] = (chip_id_value[*cscIter]%0x1000000)-chip_id_value1[*cscIter]*10000000;


CSC_SERIAL_BLOCK_END

    csicVariableTest("chip_id_part1","efuse_fail",chip_id_value1,0,0x10000000000,"");
    csicVariableTest("chip_id_part0","efuse_fail",chip_id_value0,0,0x10000000000,"");
    csicVariableTest("efuse_is_ok","efuse_fail",efuse_bad,0,0,"");
    csicVariableTest("efuse_burned","efuse_fail",efuse_burned,0,1,"");

	//csicSetDps ("alldps", 0, 100 MA, CONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    //cscUtil->wait(5e-3);
    //csicSetDps ("alldps", 0, 100 MA, DISCONNECT);
    //csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    //csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    //cscUtil->wait(1e-3);
    return ;
}



/**********************************************************************************************************
Function Name:  user_load ()
Description:    Use to precondition the device before testing, such as control Relay power and DClevel STIL
                file.
Test Required:
Test Comment:
**********************************************************************************************************/
int user_load ()
{
  cout << "#### Test parameters setting before START testing......" << endl;

  //InitUserFlag
  cscExec->UserFlag()->setInt("csicDebug", 0);    /* Enable csicDebug*/
  cscExec->UserFlag()->setInt("csicPpmuAcc", 0);  /*Enable PPMU accuracy measurement*/
  //cscExec->Datalog()->printf("Enable test time show on datalog.\n");
  cscExec->UserFlag()->setInt("csicTimer", 0);    /* "1", Enable test time show on datalog*/
  cscExec->UserFlag()->setInt("csicStdfFlag", 0); /* "1", Enable log StdfFlag*/
  cscExec->UserFlag()->setInt("SAVE_AWAV", 0);    /* Enable csicDebug*/
  cscExec->UserFlag()->setInt("RTlogFlag", 0);    /* Enable csicDebug*/

