minhlg/32_ate/esp32_ft_efuse.cpp
//  cscExec->Cmd()->execute("Log Source DCM");
//  cscExec->Cmd()->execute("Log Count 10");

  //csicLoadSpecFile("myproj.spec");
  csicDibuPowerOn("P5V_RLY"); /*suggest to put this line in user_load() rather than putting in user_main()*/
  csicDibuPowerOn("P5V");
  csicFixtureRelayOff("K1");
  csicFixtureRelayOff("K2");
  return(0);
}

/**********************************************************************************************************
Function Name:  user_sot ()
Description:    Use to debug, variable setting and it be exectue when first test after loaded test program.
Test Required:
Test Comment:
**********************************************************************************************************/
int user_sot ()
{
//        csicStdfSet(1);//sampling

  csicLogTimeStart();
  static int FirstTime = 1;
  if  (FirstTime == 1)
      { cscExec->UserFlag()->setInt("FirstTime", 1);
        FirstTime = 0;}


  if  (cscExec->UserFlag()->getInt("FirstTime") == 1)
      { cout<< "#### Doing first run UserFlag setup ......" << endl;
        cscExec->Cmd()->execute("Log Source DCM");
        cscExec->Cmd()->execute("Log Count 10");
        // Do some first run need to setup
        cscExec->UserFlag()->setInt("FirstTime", 0);}

  return(0);
}

/*================= Main test program User_main () ========================================================
Function Name:  user_main ()
Description:    All test item be execute in here, you can control test item testing sequence, mask test
                item and callback subroutine etc.
Test Required:
Test Comment:
=================== End of Main test program User_main () ===============================================*/
int user_main(void)
{

    csicTestNo = 1;

    os_test();

    io_mbist_test();
    /*
    vector<unsigned long> siteList;
    vector<unsigned long>::iterator site;

    cout << "Site 0 status:" << cscExec->Sites()->getStatus(0);
    cout << endl;
    cout << "Site 1 status:" << cscExec->Sites()->getStatus(1);
    cout << endl;
    cout << "Site 2 status:" << cscExec->Sites()->getStatus(2);
    cout << endl;
    cout << "Site 3 status:" << cscExec->Sites()->getStatus(3);
    cout << endl;

    cscExec->Sites()->getEnable(siteList);
    cout << "getEnable Sites: ";
    for (site = siteList.begin(); site != siteList.end(); ++site)
         cout << *site << " ";
         cout << endl;

    cscExec->Sites()->getDisable(siteList);
    cout << "getDisable Sites: ";
    for (site = siteList.begin(); site != siteList.end(); ++site)
         cout << *site << " ";
         cout << endl;


    cscExec->Sites()->getActive(siteList);
    cout << "getActive Sites: ";
    for (site = siteList.begin(); site != siteList.end(); ++site)
         cout << *site << " ";
         cout << endl;

    cscExec->Sites()->getEOSInactive(siteList);
    cout << "getEOSInactive Sites: ";
    for (site = siteList.begin(); site != siteList.end(); ++site)
         cout << *site << " ";
         cout << endl;

*/
    //efuse_test();

    scan_test();

    func_measure();

    func_ana();

/*if (DC_scan_result==1) {
    csicBinFail("dc_scan_fail",STOP);
}

if (AC_scan_result==1) {
    csicBinFail("ac_scan_fail",STOP);
}
*/

/*
    cout << "Site 0 status:" << cscExec->Sites()->getStatus(0);
    cout << endl;
    cout << "Site 1 status:" << cscExec->Sites()->getStatus(1);
    cout << endl;
    cout << "Site 2 status:" << cscExec->Sites()->getStatus(2);
    cout << endl;
    cout << "Site 3 status:" << cscExec->Sites()->getStatus(3);
    cout << endl;

    cscExec->Sites()->getEnable(siteList);
    cout << "getEnable Sites: ";
    for (site = siteList.begin(); site != siteList.end(); ++site)
         cout << *site << " ";
         cout << endl;

    cscExec->Sites()->getDisable(siteList);
    cout << "getDisable Sites: ";
    for (site = siteList.begin(); site != siteList.end(); ++site)
         cout << *site << " ";
         cout << endl;


    cscExec->Sites()->getActive(siteList);
    cout << "getActive Sites: ";
    for (site = siteList.begin(); site != siteList.end(); ++site)
         cout << *site << " ";
         cout << endl;

    cscExec->Sites()->getEOSInactive(siteList);
    cout << "getEOSInactive Sites: ";
    for (site = siteList.begin(); site != siteList.end(); ++site)
         cout << *site << " ";
         cout << endl;
*/
    csicBinPass("pass", CONTINUE);

	return(0);
}
/*
int user_eot(){
	cscExec->Datalog()->printf("executing user_eot(): powering down\n");

    const time_t t = std::time(NULL);
    struct tm* current_time = localtime(&t);
    cscExec->Datalog()->printf("Test end time : %d%02d%02d_%02d%02d%02d\n",1900 + current_time->tm_year, 1 + current_time->tm_mon,  current_time->tm_mday, current_time->tm_hour, current_time->tm_min, current_time->tm_sec);

    if(cscTester->Seq()->getRunStatus() == BUSY)cscTester->Seq()->forceStop();//force sequencer stop running
    csicSetPpmuOff("allpins");
	csicDisableDpin("allpins");
    csicSetDps ("VBAT", 0.0, 100 MA, CONNECT);
    csicSetDps ("DVDD_IO", 0.0, 100 MA, CONNECT);
    csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
	cscTester->DCLevels()->Signal("CHIP_EN")->setForceLo();
	CSIC_WAIT(10 MS);
    csicSetDps ("DVDD_IO", 0.0, 100 MA, DISCONNECT);
    csicSetDps ("VBAT", 0.0, 100 MA, DISCONNECT);
    csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
//	CSIC_WAIT(1000 MS);
 	return(0);
}
*/
int user_eot(){
    /*
  vector<unsigned long> siteList;
  vector<unsigned long>::iterator site;

  cout << "Site 0 status:" << cscExec->Sites()->getStatus(0);
  cout << endl;
  cout << "Site 1 status:" << cscExec->Sites()->getStatus(1);
  cout << endl;
  cout << "Site 2 status:" << cscExec->Sites()->getStatus(2);
  cout << endl;
  cout << "Site 3 status:" << cscExec->Sites()->getStatus(3);
  cout << endl;

  cscExec->Sites()->getEnable(siteList);
  cout << "getEnable Sites: ";
  for (site = siteList.begin(); site != siteList.end(); ++site)
       cout << *site << " ";
       cout << endl;

