minhlg/32_ate/esp32_ft_efuse.cpp
  cscExec->Sites()->getDisable(siteList);
  cout << "getDisable Sites: ";
  for (site = siteList.begin(); site != siteList.end(); ++site)
       cout << *site << " ";
       cout << endl;


  cscExec->Sites()->getActive(siteList);
  cout << "getActive Sites: ";
  for (site = siteList.begin(); site != siteList.end(); ++site)
       cout << *site << " ";
       cout << endl;

  cscExec->Sites()->getEOSInactive(siteList);
  cout << "getEOSInactive Sites: ";
  for (site = siteList.begin(); site != siteList.end(); ++site)
       cout << *site << " ";
       cout << endl;
*/
	cscExec->Datalog()->printf("executing user_eot(): powering down\n");

    const time_t t = std::time(NULL);
    struct tm* current_time = localtime(&t);
    cscExec->Datalog()->printf("Test end time : %d%02d%02d_%02d%02d%02d\n",1900 + current_time->tm_year, 1 + current_time->tm_mon,  current_time->tm_mday, current_time->tm_hour, current_time->tm_min, current_time->tm_sec);

    if(cscTester->Seq()->getRunStatus() == BUSY)cscTester->Seq()->forceStop();//force sequencer stop running
	cscTester->DCLevels()->Signal("RSTB")->setForceLo();
    CSIC_WAIT(0.5 MS);
    cscTester->DPS()->Signal("VDD11")->disconnect();
    cscTester->DPS()->Signal("DVDD11")->disconnect();
    CSIC_WAIT(20 MS);
    csicSetDps ("VBAT", 0.0, 100 MA, CONNECT);
    csicSetDps ("DVDD_IO", 0.0, 100 MA, CONNECT);
    csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    csicSetDpinLevels("allpins", 0.0, 2.5, 1.2, 1.2);
	cscTester->DCLevels()->Signal("allpins")->setForceLo();
	CSIC_WAIT(50 MS);
    csicSetDps ("DVDD_IO", 0.0, 100 MA, DISCONNECT);
    csicSetDps ("VBAT", 0.0, 100 MA, DISCONNECT);
    csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
    csicSetPpmuOff("allpins");
	csicDisableDpin("allpins");
    csicDisableDpin("LNA");
    csicSetPpmuOff("LNA");
    csicDisableDpin("TOUT");
    csicSetPpmuOff("TOUT");
	//CSIC_WAIT(500 MS);
 	return(0);
}

/*
int user_eot(){
	cscExec->Datalog()->printf("executing user_eot(): powering down\n");

    const time_t t = std::time(NULL);
    struct tm* current_time = localtime(&t);
    cscExec->Datalog()->printf("Test end time : %d%02d%02d_%02d%02d%02d\n",1900 + current_time->tm_year, 1 + current_time->tm_mon,  current_time->tm_mday, current_time->tm_hour, current_time->tm_min, current_time->tm_sec);

    if(cscTester->Seq()->getRunStatus() == BUSY)cscTester->Seq()->forceStop();//force sequencer stop running

    csicSetDps ("VBAT", 0.0, 100 MA, CONNECT);
    csicSetDps ("DVDD_IO", 0.0, 100 MA, CONNECT);
    csicSetDps ("VDD11",  0, 100 MA, CONNECT);
    csicSetDps ("DVDD11", 0, 100 MA, CONNECT);
    CSIC_WAIT(5 MS);
	cscTester->DCLevels()->Signal("allpins")->setForceLo();
	CSIC_WAIT(15 MS);
    csicSetPpmuOff("allpins");
	csicDisableDpin("allpins");

    csicSetDps ("DVDD_IO", 0.0, 100 MA, DISCONNECT);
    csicSetDps ("VBAT", 0.0, 100 MA, DISCONNECT);
    csicSetDps ("VDD11",  0, 100 MA, DISCONNECT);
    csicSetDps ("DVDD11", 0, 100 MA, DISCONNECT);
 	return(0);
}
*/

